import re
s = 'Tue Mar 19 16:23:02 2019,杭州租房网 >  萧山租房 >  钱江世纪城租房 >   佳境天城人合苑租房  , 合租·佳境天城人合' \
    '苑4室1厅, 2430元/月(季付价), 公寓 独立卫生间 近地铁 押一付一 随时看房 , 合租 4室1厅2卫 16㎡ 朝南  房屋信息  基本信' \
    '息 发布：12天前 入住：随时入住   租期：暂无数据 看房：随时可看   楼层：5/18层 电梯：暂无数据   车位：暂无数据 用' \
    '水：暂无数据   用电：暂无数据 燃气：暂无数据   采暖：暂无数据  ,None, 地址和交通距离地铁2号线-振宁路329m, end '
s = re.sub(r'[0-9]+:[0-9]+:[0-9]+ ', '', s)
print(s)
s = re.sub(r'> ', '', s)
print(s)
s = re.sub(r'(合租|整租+ )', ' ', s)
print(s)
m = re.match(r"^([A-Za-z]{3} ),([A-Za-z]{3} ),(%d{4} ),([\u4e00-\u9fa5]+租房网? ),([\u4e00-\u9fa5]+租房网? ),([\u4e00-\u"
             r"9fa5]+租房网?),([0-9]室[0-9]厅[0-9]卫 ),([0-9]+元/月),([0-9]+㎡ ),(朝[东南西北] )")  # 10个
m11 = s.findall("楼层：(.*?)", s)
m12 = s.findall("")
m14 = s.findall("租期：(.*? )", s)
m15 = s.findall("")